Revit 2026 API

# TilePatterns Class

---

The TilePatterns object is an interface for retrieving the TilePattern objects within the Document.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBTilePatterns

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class TilePatterns : APIObject
```
```vb
Public Class TilePatterns
	Inherits APIObject
```
```cpp
public ref class TilePatterns : public APIObject
```
```fsharp
type TilePatterns =
    class
        inherit APIObject
    end
```

The TilePatterns type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetTilePattern | Retrieve a TilePattern object from a built-in type. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace